package day28;

public class Ex1231_05 {

	public static void main(String[] args) {
		// --------------------------------------------
		// 복권번호를 입력받아
		// 복권번호 랜덤숫자 1조,2조,3조...9조 -> 9개
		// 0000000 - 9999999 번까지 숫자 중복 가능 ( 8877878 )
		// 당첨번호 : 8조 8827878
		//                   8 1개 1000원
		//                  78 2개 10000원
		//                 878 3개 100000원
		//                7878 4개 1000000원
		//               27878 5개 10000000원
		//              827878 6개 100000000원
		//             8827878 7개 1000000000원
		//           8조8827878 8개 10000000000원
		// 입력번호 : 1조 
		//          1524771
		// ---------------------
		// 당첨번호 : 0 0
		// 당첨된 번호개수 : 2개
		
		
		//    
		
		
		

	}

}
